#  Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2 3

S = int(input('ссума чисел S:'))
P = int(input('произведение чисел P:'))
for i in range(1, 1000):
    if i + (P / i) == S:
       print(f' X = "{i}", Y = "{(P // i)}"')
